In [1]:
import numpy as np
import pandas as pd 
from pandas import Series,DataFrame

In [15]:
dframe = DataFrame({'city':['Amaravati','Jaipur','Hyderabad','Mumbai'],
                   'altitude':[1800,1200,1320,1440]})
dframe

        city  altitude
0  Amaravati      1800
1     Jaipur      1200
2  Hyderabad      1320
3     Mumbai      1440

In [20]:
state_map = {'Amaravati':'Andhra pradesh','Jaipur':'Rajasthan','Hyderabad':'Telengana','Mumbai':'Maharastra'}

In [22]:
dframe['State'] = dframe['city'].map(state_map)

In [24]:
dframe

        city  altitude           State
0  Amaravati      1800  Andhra pradesh
1     Jaipur      1200       Rajasthan
2  Hyderabad      1320       Telengana
3     Mumbai      1440      Maharastra